BaukovGK/esp32p4_HMI_screen/sdkconfig.defaults
# Target — Waveshare ESP32-P4-NANO.
# Оба ключа нужны: CONFIG_IDF_TARGET — строковая идентификация,
# CONFIG_IDF_TARGET_ESP32P4=y активирует зависимые опции
# (SOC_MIPI_DSI_SUPPORTED через soc_caps.h, без этого esp_lcd/dsi/*
# не собирается и esp_lcd_mipi_dsi.h не находится).
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM (critical for MIPI DSI display)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# L2 Cache (critical for PSRAM bandwidth)
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Experimental features (needed for PSRAM 200MHz)
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Task watchdog (UI init takes several seconds)
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y

# Ethernet (Waveshare ESP32-P4-NANO: IP101 PHY, RST на GPIO51)
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_RST_GPIO=51

# Console (UART — через USB-UART мост на COM-порту прошивки)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# I2C: разрешить одновременное использование legacy и нового драйвера
# (компонент waveshare/esp_lcd_jd9365 использует legacy i2c_bus,
#  а board_i2c и touch используют новый i2c_master API)
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y

# Отключить сборку LVGL демо-примеров (экономия flash)
CONFIG_LV_BUILD_EXAMPLES=n

# MQTT
CONFIG_MQTT_BUFFER_SIZE=2048
